app/views/properties/index.html.erb

    <!-- Contractors -->
    <% if @property.contractors.any? %>
---
SELECT "contractors".* FROM "contractors" WHERE "contractors"."property_id" = ?  [["property_id", 298486374]]
SELECT COUNT(*) FROM "contractors" WHERE "contractors"."property_id" = ?  [["property_id", 298486374]]

    <!-- Lawyers -->
    <% if @property.lawyers.any? %>
---
SELECT "lawyers".* FROM "lawyers" WHERE "lawyers"."property_id" = ?  [["property_id", 298486374]]
SELECT COUNT(*) FROM "lawyers" WHERE "lawyers"."property_id" = ?  [["property_id", 298486374]]