app/controllers/properties_controller.rb

SELECT "contractors".* FROM "contractors" WHERE "contractors"."property_id" = ?  [["property_id", 298486374]]
SELECT "lawyers".* FROM "lawyers" WHERE "lawyers"."property_id" = ?  [["property_id", 298486374]]
SELECT "properties".* FROM "properties" ORDER BY "properties"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    # Load the first property with all its associations
    @property = Property.includes(:contractors, :lawyers, :documents).first